app/controllers/api/family_members_controller.rb

SELECT "family_members".* FROM "family_members" ORDER BY "family_members"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def find_all_family_trees
    @family_trees = FamilyMember.find_members_with_children # getting all family members with children

SELECT "family_members".* FROM "family_members" WHERE "family_members"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def show # this shows a family tree for a specefic member of family
    @root = FamilyMember.find_by(id: params[:id])