app/controllers/api/family_members_controller.rb

  def show # this shows a family tree for a specefic member of family
    @root = FamilyMember.first
---
SELECT "family_members".* FROM "family_members" LIMIT $1  [["LIMIT", 11]]