app/models/family_member.rb

  def create_family_tree(tree)
    tree["name"] =self.fname

    if self.children.length > 0
---
SELECT "family_members".* FROM "family_members" ORDER BY "family_members"."id" ASC LIMIT $1  [["LIMIT", 1]]

  def self.find_members_with_children
    family_members = FamilyMember.all.includes(:children)

    family_members.select do |family_member|
---
SELECT "family_members".* FROM "family_members" WHERE "family_members"."id" IN ($1, $2, $3, $4, $5)  [["id", 111], ["id", 112], ["id", 113], ["id", 114], ["id", 117]]